
## Plan Result (dev/bootstrap)

[CI link](https://github.com/tqer39/edu-quest/actions/runs/18629765089)


<pre><code>Plan: 5 to add, 1 to change, 0 to destroy.</code></pre>

* Create
  * module.cf_app_resources.cloudflare_d1_database.app
  * module.cf_app_resources.cloudflare_workers_kv_namespace.kv[&#34;auth_session&#34;]
  * module.cf_app_resources.cloudflare_workers_kv_namespace.kv[&#34;free_trial&#34;]
  * module.cf_app_resources.cloudflare_workers_kv_namespace.kv[&#34;idempotency&#34;]
  * module.cf_app_resources.cloudflare_workers_kv_namespace.kv[&#34;rate_limit&#34;]
* Update
  * module.deploy_role.aws_iam_role.this


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.cf_app_resources.cloudflare_d1_database.app will be created
  + resource "cloudflare_d1_database" "app" {
      + account_id       = "3c9a0adf6781e171e263a64f78c41ec4"
      + created_at       = (known after apply)
      + file_size        = (known after apply)
      + id               = (known after apply)
      + name             = "mathquest_dev_db"
      + num_tables       = (known after apply)
      + read_replication = {
          + mode = "disabled"
        }
      + uuid             = (known after apply)
      + version          = (known after apply)
    }

  # module.cf_app_resources.cloudflare_workers_kv_namespace.kv["auth_session"] will be created
  + resource "cloudflare_workers_kv_namespace" "kv" {
      + account_id            = "3c9a0adf6781e171e263a64f78c41ec4"
      + id                    = (known after apply)
      + supports_url_encoding = (known after apply)
      + title                 = "mathquest-dev-auth-session"
    }

  # module.cf_app_resources.cloudflare_workers_kv_namespace.kv["free_trial"] will be created
  + resource "cloudflare_workers_kv_namespace" "kv" {
      + account_id            = "3c9a0adf6781e171e263a64f78c41ec4"
      + id                    = (known after apply)
      + supports_url_encoding = (known after apply)
      + title                 = "mathquest-dev-free-trial"
    }

  # module.cf_app_resources.cloudflare_workers_kv_namespace.kv["idempotency"] will be created
  + resource "cloudflare_workers_kv_namespace" "kv" {
      + account_id            = "3c9a0adf6781e171e263a64f78c41ec4"
      + id                    = (known after apply)
      + supports_url_encoding = (known after apply)
      + title                 = "mathquest-dev-idempotency"
    }

  # module.cf_app_resources.cloudflare_workers_kv_namespace.kv["rate_limit"] will be created
  + resource "cloudflare_workers_kv_namespace" "kv" {
      + account_id            = "3c9a0adf6781e171e263a64f78c41ec4"
      + id                    = (known after apply)
      + supports_url_encoding = (known after apply)
      + title                 = "mathquest-dev-rate-limit"
    }

  # module.deploy_role.aws_iam_role.this will be updated in-place
  ~ resource "aws_iam_role" "this" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Condition = {
                          ~ StringLike = {
                              ~ "token.actions.githubusercontent.com:sub" = "repo:tqer39/edu-quest:*" -> "repo:tqer39/mathquest:*"
                            }
                        }
                        # (3 unchanged attributes hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "portfolio-mathquest-terraform-deploy-dev"
        name                  = "portfolio-mathquest-terraform-deploy-dev"
        tags                  = {}
        # (11 unchanged attributes hidden)
    }

Plan: 5 to add, 1 to change, 0 to destroy.

Warning: Resource not found

  with module.cf_app_resources.cloudflare_d1_database.app,
  on ../../../modules/cf-app-resources/main.tf line 28, in resource "cloudflare_d1_database" "app":
  28: resource "cloudflare_d1_database" "app" {

The resource was not found on the server and will be removed from state.

(and one more similar warning elsewhere)
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.cf_app_resources.cloudflare_d1_database.app has been deleted
  - resource "cloudflare_d1_database" "app" {
      - id               = "d9e00de1-3f93-43ca-8e76-85422f725b40" -> null
      - name             = "mathquest_dev_db" -> null
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>


## :warning: Warnings

```hcl
Warning: Resource not found

  with module.cf_app_resources.cloudflare_d1_database.app,
  on ../../../modules/cf-app-resources/main.tf line 28, in resource "cloudflare_d1_database" "app":
  28: resource "cloudflare_d1_database" "app" {

The resource was not found on the server and will be removed from state.

(and one more similar warning elsewhere)
```



<!-- github-comment: {"Command":"plan","JobName":"terraform-dev","PRNumber":105,"Program":"tfcmt","SHA1":"60e8d2da80d2e7e83a03926f7d27abdee67dbc6a","Target":"dev/bootstrap","Vars":{},"WorkflowName":"Terraform - dev"} -->